Autodesk.Revit.DB.IFailuresProcessor.Dismiss(Autodesk.Revit.DB.Document)
This method is being called in case of exception or document destruction to dismiss any possible pending failure UI that may
have left on the screen
document:
Document for which pending failures processing UI should be dismissed

Autodesk.Revit.DB.IFailuresProcessor.ProcessFailures(Autodesk.Revit.DB.FailuresAccessor)
Method that Revit will invoke to process failures at the end of transaction.
Remarks:
This method is invoked after some failures may have been handled by any FailuresPreprocessor
and/or FailureProcessing event subscribers.
data:
Provides all necessary data to perform the resolution of failures.
Returns:
The result of the failures processing.
Continue - Should be returned if there were no failures or highest failure severity was "Warning" and all warnings were deleted.
If some failures are still present and "Continue" is returned, it will be treated as "ProceedWithRollback".
Note: If this method has attempted to resolve failures, it should return "ProceedWithCommit"
to repeat end of transaction checks and failures processing.ProceedWithCommit - End of transaction checks and failure processing will restart from the beginning.
If some failures were resolved, they will be removed and not delivered to the user.
ProceedWithCommit cannot be returned if transaction is being rolled back.ProceedWithRollBack - Transaction will be rolled back 	even if Commit was originally requested.WaitForUserInput - Should be returned if method has activated modeless user interaction and is waiting for an external event
(typically user input) to complete failures processing.

Autodesk.Revit.DB.IFailuresProcessor
To create your own UI or fully automated tool to process Revit Failures, derive a class from this interface.
Remarks:
To override Revit default Failures Processing UI, instantiate your own processor derived from this interface
and register it in Revit application.